src/Catalogs/цур_ИнформационныеБазы/цур_ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>СервернаяБаза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляСборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникМетаданных</name>
    <type>
      <types>EnumRef.цур_ИсточникиМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникРолей</name>
    <type>
      <types>EnumRef.цур_РежимыЗагрузкиРолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПлатформе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПромежуточнуюБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/цур_ИсточникиМетаданных/цур_ИсточникиМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_ИсточникиМетаданных</name>
  <enumValues>
    <name>ТекущаяКонфигурация</name>
  </enumValues>
  <enumValues>
    <name>ИзКаталогаФайлов</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/Enums/цур_РежимыЗагрузкиРолей/цур_РежимыЗагрузкиРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_РежимыЗагрузкиРолей</name>
  <enumValues>
    <name>ИзКаталогаВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/цур_ИнформационныеБазы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Заполняет новый элемент справочника значениями из предопределённого элемента ПоУмолчанию.
// Применяется только при создании нового элемента через интерфейс.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - стандартный параметр платформы
//  ТекстЗаполнения      - Строка       - стандартный параметр платформы
//  СтандартнаяОбработка - Булево       - стандартный параметр платформы
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Ссылка = Справочники.цур_ИнформационныеБазы.ПоУмолчанию Тогда
		Возврат;
	КонецЕсли;

	Шаблон = Справочники.цур_ИнформационныеБазы.ПоУмолчанию;

	Если ЗначениеЗаполнено(Шаблон) Тогда

		Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,
			"ПутьКПлатформе, ИспользоватьБСП, ИспользоватьПромежуточнуюБазу,
			|ИсточникМетаданных, ИсточникРолей, КаталогВыгрузкиКонфигурации");

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИсточникМетаданных) Тогда
		ИсточникМетаданных = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИсточникРолей) Тогда
		ИсточникРолей = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
